title: AWS Bucket Deleted
id: 39c9f26d-6e3b-4dbb-9c7a-4154b0281112
status: experimental
description: |
    Detects the deletion of S3 buckets in AWS CloudTrail logs.
author: Ivan Saakov
date: 2025-10-19
tags:
    - attack.defense-evasion
    - attack.t1485
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'DeleteBucket'
    condition: selection
level: medium
